# Data selection & filtering

In [2]:
import pandas as pd

In [4]:
df=pd.read_excel("studen.xlsx")
print(df)

       Name   Age      City Course College
0       Ram  20.0     Delhi    MCA     SMS
1     Shyam  22.0    Mumbai    BCA     SMS
2     Rohan  21.0     Patna    BBA     SMS
3     Rohit  15.0  Varanasi    BCA     SMS
4     Priti  13.0     Delhi    MCA     SMS
5     Pooja  23.0    Mumbai    MCA     SMS
6   Shivam   11.0  Varanasi    BBA     SMS
7      Aman  20.0  Varanasi    BCA     SMS
8     Kunal  34.0     Delhi    BBA     SMS
9      Anna  11.0     Patna    NaN     SMS
10   Bhavna  23.0    Mumbai    MBA     SMS
11      Ram  20.0     Delhi    MCA     SMS
12      NaN  20.0    Mumbai    NaN     SMS
13    Vivek   NaN     Delhi    BBA     SMS

In [7]:
type(df['Name'])

pandas.core.series.Series

In [9]:
df[['Name','Age']]

       Name   Age
0       Ram  20.0
1     Shyam  22.0
2     Rohan  21.0
3     Rohit  15.0
4     Priti  13.0
5     Pooja  23.0
6   Shivam   11.0
7      Aman  20.0
8     Kunal  34.0
9      Anna  11.0
10   Bhavna  23.0
11      Ram  20.0
12      NaN  20.0
13    Vivek   NaN

In [11]:
df.loc[0]

Name         Ram
Age         20.0
City       Delhi
Course       MCA
College      SMS
Name: 0, dtype: object

In [13]:
df.iloc[0]

Name         Ram
Age         20.0
City       Delhi
Course       MCA
College      SMS
Name: 0, dtype: object

In [15]:
df.loc[0,'Name']

'Ram'

In [19]:
df.iloc[0,2]

'Delhi'

In [21]:
df.at[0,'Name']

'Ram'

In [22]:
df.iat[0,2]

'Delhi'

# Filtering with conditions:-

In [24]:
df[df["Age"]>20]

      Name   Age    City Course College
1    Shyam  22.0  Mumbai    BCA     SMS
2    Rohan  21.0   Patna    BBA     SMS
5    Pooja  23.0  Mumbai    MCA     SMS
8    Kunal  34.0   Delhi    BBA     SMS
10  Bhavna  23.0  Mumbai    MBA     SMS

In [25]:
df[(df["Age"]>10) & (df["City"]=="Varanasi")]

      Name   Age      City Course College
3    Rohit  15.0  Varanasi    BCA     SMS
6  Shivam   11.0  Varanasi    BBA     SMS
7     Aman  20.0  Varanasi    BCA     SMS

In [27]:
df[(df["Age"]>20) | (df["City"]=="Varanasi")]

       Name   Age      City Course College
1     Shyam  22.0    Mumbai    BCA     SMS
2     Rohan  21.0     Patna    BBA     SMS
3     Rohit  15.0  Varanasi    BCA     SMS
5     Pooja  23.0    Mumbai    MCA     SMS
6   Shivam   11.0  Varanasi    BBA     SMS
7      Aman  20.0  Varanasi    BCA     SMS
8     Kunal  34.0     Delhi    BBA     SMS
10   Bhavna  23.0    Mumbai    MBA     SMS

In [29]:
df.query("Age > 20 and City == 'Patna' ")

    Name   Age   City Course College
2  Rohan  21.0  Patna    BBA     SMS

In [31]:
col="Age"
df.query(f"{col}>20")

      Name   Age    City Course College
1    Shyam  22.0  Mumbai    BCA     SMS
2    Rohan  21.0   Patna    BBA     SMS
5    Pooja  23.0  Mumbai    MCA     SMS
8    Kunal  34.0   Delhi    BBA     SMS
10  Bhavna  23.0  Mumbai    MBA     SMS

In [34]:
df.query("Name == 'Bhavna'")

      Name   Age    City Course College
10  Bhavna  23.0  Mumbai    MBA     SMS

In [33]:
df.query("City == 'Mumbai'")

      Name   Age    City Course College
1    Shyam  22.0  Mumbai    BCA     SMS
5    Pooja  23.0  Mumbai    MCA     SMS
10  Bhavna  23.0  Mumbai    MBA     SMS
12     NaN  20.0  Mumbai    NaN     SMS